In [1]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}

df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [5]:
df

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

## melt() — Wide to Long

In [14]:
df.melt(id_vars=["Name"])

      Name variable  value
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [21]:
df2 = df.melt(id_vars = ["Name"], value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score").copy()
df2

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

Explanation:
id_vars=["Name"]: We keep the "Name" column as it is because it's the identifier.
value_vars=["Math", "Science", "English"]: These are the columns we want to melt.
var_name="Subject": The new column containing the names of the subjects.
value_name="Score": The new column containing the scores.

## pivot() — Long to Wide

In [27]:
df2.pivot(index="Name", columns="Subject", values="Score")

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

### Example of pivot_table() to handle duplicates:

Suppose the DataFrame is like this (with duplicate entries):

Name	Subject	Score
Alice	Math	85
Alice	Math	80
Alice	Science	90
Bob	Math	78
Bob	Math	82
We can use pivot_table() to aggregate values (e.g., taking the mean for duplicate entries):

df.pivot_table(index="Name", columns="Subject", values="Score", aggfunc="mean")

Resulting DataFrame:
Name	Math	Science
Alice	82.5	90
Bob	80	NaN